____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
convolution2d_1 (Convolution2D)  (None, 32, 32, 96)    2688        convolution2d_input_1[0][0]      
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 32, 32, 96)    0           convolution2d_1[0][0]            
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, 32, 32, 96)    83040       activation_1[0][0]               
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 32, 32, 96)    0           convolution2d_2[0][0]            
____________________________________________________________________________________________________
maxpooling2d_1 (MaxPooling2D)    (None, 15, 15, 96)    0           activation_2[0][0]               
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)  (None, 15, 15, 192)   166080      maxpooling2d_1[0][0]             
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 15, 15, 192)   0           convolution2d_3[0][0]            
____________________________________________________________________________________________________
convolution2d_4 (Convolution2D)  (None, 15, 15, 192)   331968      activation_3[0][0]               
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 15, 15, 192)   0           convolution2d_4[0][0]            
____________________________________________________________________________________________________
maxpooling2d_2 (MaxPooling2D)    (None, 7, 7, 192)     0           activation_4[0][0]               
____________________________________________________________________________________________________
convolution2d_5 (Convolution2D)  (None, 7, 7, 192)     331968      maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 7, 7, 192)     0           convolution2d_5[0][0]            
____________________________________________________________________________________________________
convolution2d_6 (Convolution2D)  (None, 7, 7, 192)     37056       activation_5[0][0]               
____________________________________________________________________________________________________
activation_6 (Activation)        (None, 7, 7, 192)     0           convolution2d_6[0][0]            
____________________________________________________________________________________________________
convolution2d_7 (Convolution2D)  (None, 7, 7, 10)      1930        activation_6[0][0]               
____________________________________________________________________________________________________
activation_7 (Activation)        (None, 7, 7, 10)      0           convolution2d_7[0][0]            
____________________________________________________________________________________________________
globalaveragepooling2d_1 (GlobalA(None, 10)            0           activation_7[0][0]               
____________________________________________________________________________________________________
activation_8 (Activation)        (None, 10)            0           globalaveragepooling2d_1[0][0]   
====================================================================================================
Total params: 954730
____________________________________________________________________________________________________
None
