____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
zeropadding2d_1 (ZeroPadding2D)  (None, 34, 34, 3)     0           zeropadding2d_input_1[0][0]      
____________________________________________________________________________________________________
convolution2d_1 (Convolution2D)  (None, 32, 32, 64)    1792        zeropadding2d_1[0][0]            
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 32, 32, 64)    0           convolution2d_1[0][0]            
____________________________________________________________________________________________________
maxpooling2d_1 (MaxPooling2D)    (None, 16, 16, 64)    0           activation_1[0][0]               
____________________________________________________________________________________________________
zeropadding2d_2 (ZeroPadding2D)  (None, 18, 18, 64)    0           maxpooling2d_1[0][0]             
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, 16, 16, 128)   73856       zeropadding2d_2[0][0]            
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 16, 16, 128)   0           convolution2d_2[0][0]            
____________________________________________________________________________________________________
maxpooling2d_2 (MaxPooling2D)    (None, 8, 8, 128)     0           activation_2[0][0]               
____________________________________________________________________________________________________
zeropadding2d_3 (ZeroPadding2D)  (None, 10, 10, 128)   0           maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)  (None, 8, 8, 256)     295168      zeropadding2d_3[0][0]            
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 8, 8, 256)     0           convolution2d_3[0][0]            
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 16384)         0           activation_3[0][0]               
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 1024)          16778240    flatten_1[0][0]                  
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 1024)          0           dense_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 1024)          1049600     dropout_1[0][0]                  
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 1024)          0           dense_2[0][0]                    
____________________________________________________________________________________________________
dense_3 (Dense)                  (None, 10)            10250       dropout_2[0][0]                  
====================================================================================================
Total params: 18208906
____________________________________________________________________________________________________
None
